app/views/rooms/show.html.erb

  <div id="messages">
    <% @room.messages.each do |r| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1  [["room_id", 38]]